sims/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| ========= | |
| \\ / F ield | OpenFOAM: The Open Source CFD Toolbox |
| \\ / O peration | Version: 3.0.1 |
| \\ / A nd | Web: www.OpenFOAM.org |
| \\/ M anipulation | |
\*---------------------------------------------------------------------------*/
FoamFile
{
version 2.0;
format ascii;
class dictionary;
object createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

patches
(
    {
        name walls;
        patchInfo
        {
            type wall;
        }

        constructFrom patches;
        patches (auto0);
    }
    {
        
        name frontAndBack;
        patchInfo
        {
      	    type empty;
        } 
        constructFrom patches;
        patches (auto1 auto2);
    }
    
    {
	name farfield;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches (auto3);
    } 

);

// ************************************************** *********************** //
