sims/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          299;
        startFace       64883;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          65182;
        startFace       65182;
    }
    farfield
    {
        type            patch;
        nFaces          299;
        startFace       130364;
    }
)

// ************************************************************************* //
